export const regions = [
  {
    value: 'AK',
    label: 'АР Крим',
  },
  {
    value: 'AB',
    label: 'Вінницька область',
  },
  {
    value: 'AC',
    label: 'Волинська область',
  },
  {
    value: 'AE',
    label: 'Дніпропетровська область',
  },
  {
    value: 'AH',
    label: 'Донецька область',
  },
  {
    value: 'AM',
    label: 'Житомирська область',
  },
  {
    value: 'AO',
    label: 'Закарпатська область',
  },
  {
    value: 'AP',
    label: 'Запорізька область',
  },
  {
    value: 'AT',
    label: 'Івано-Франківська область',
  },
  {
    value: 'AI',
    label: 'Київська область',
  },
  {
    value: 'BA',
    label: 'Кіровоградська область',
  },
  {
    value: 'BB',
    label: 'Луганська область',
  },
  {
    value: 'BC',
    label: 'Львівська область',
  },
  {
    value: 'BE',
    label: 'Миколаївська область',
  },
  {
    value: 'BH',
    label: 'Одеська область',
  },
  {
    value: 'BI',
    label: 'Полтавська область',
  },
  {
    value: 'BK',
    label: 'Рівненська область',
  },
  {
    value: 'BM',
    label: 'Сумська область',
  },
  {
    value: 'BO',
    label: 'Тернопільська область',
  },
  {
    value: 'AX',
    label: 'Харківська область',
  },
  {
    value: 'BT',
    label: 'Херсонська область',
  },
  {
    value: 'BX',
    label: 'Хмельницька область',
  },
  {
    value: 'CA',
    label: 'Черкаська область',
  },
  {
    value: 'CB',
    label: 'Чернігівська область',
  },
  {
    value: 'CE',
    label: 'Чернівецька область',
  },
];

/*

АР Крим	01	AK
Вінницька область	02	AB
Волинська область	03	AC
Дніпропетровська область	04	AE
Донецька область	05	AH
Житомирська область	06	AM
Закарпатська область	07	AO
Запорізька область	08	AP
Івано-Франківська область	09	AT
Київська область	10	AI
м. Київ	11	AA
Кіровоградська область	12	BA
Луганська область	13	BB
Львівська область	14	BC
Миколаївська область	15	BE
Одеська область	16	BH
Полтавська область	17	BI
Рівненська область	18	BK
Сумська область	19	BM
Тернопільська область	20	BO
Харківська область	21	AX
Херсонська область	22	BT
Хмельницька область	23	BX
Черкаська область	24	CA
Чернігівська область	25	CB
Чернівецька область	26	CE
*/
