import * as yup from 'yup';

const passwordRules =
  /^.*(?=.{8,})((?=.*[!@#$%^&*()\-_=+{};:,<.>]){1})(?=.*\d)((?=.*[a-z]){1})((?=.*[A-Z]){1}).*$/;

export const LoginSchema = yup.object({
  email: yup
    .string('Введіть адресу електронної пошти')
    .email('Введіть валідну адресу електронної пошти')
    .required("Поле обов'язкове для заповнення"),
  password: yup
    .string('Введіть пароль')
    .min(8, 'Пароль має бути мінімум 8 символів')
    .matches(
      passwordRules,
      'Пароль має містити хоча б одину велику літеру, одну цифру та один спеціальний символ'
    )
    .required("Поле обов'язкове для заповнення"),
});

export const RegisterSchema = yup.object({
  email: yup
    .string('Введіть адресу електронної пошти')
    .email('Введіть валідну адресу електронної пошти')
    .required("Поле обов'язкове для заповнення"),

  password: yup
    .string('Введіть пароль')
    .min(8, 'Пароль має бути мінімум 8 символів')
    .matches(
      passwordRules,
      'Пароль має містити хоча б одину велику літеру, одну цифру та один спеціальний символ'
    )
    .required("Поле обов'язкове для заповнення"),

  confirmPassword: yup
    .string('Повторіть пароль')
    .oneOf([yup.ref('password'), null], 'пароль має співпадати')
    .required("Поле обов'язкове для заповнення"),

  name: yup
    .string("Введіть ім'я")
    .min(2, "Ім'я має містити мінімум 2 символа")
    .required("Поле обов'язкове для заповнення"),

  surname: yup
    .string('Введіть прізвище')
    .required("Поле обов'язкове для заповнення"),
});
